Res-container-setEven-randomFront-v6/container_t_4_c_6_frontCore_1_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 4965.778ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5110.908ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 5074.557ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 4993.318ms, rate sampling interval: 17809ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    24.42s     9.91s   50.69s    71.15%
    Req/Sec   166.38      1.73   170.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.92s 
 75.000%   30.10s 
 90.000%   39.22s 
 99.000%   50.69s 
 99.900%    0.86m 
 99.990%    0.86m 
 99.999%    0.86m 
100.000%    0.86m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9953.279     0.000000            2         1.00
   12976.127     0.100000         3342         1.11
   15302.655     0.200000         6663         1.25
   18153.471     0.300000         9993         1.43
   21086.207     0.400000        13335         1.67
   22921.215     0.500000        16661         2.00
   23773.183     0.550000        18325         2.22
   24805.375     0.600000        19983         2.50
   26083.327     0.650000        21677         2.86
   28540.927     0.700000        23328         3.33
   30097.407     0.750000        25007         4.00
   30801.919     0.775000        25831         4.44
   31473.663     0.800000        26655         5.00
   32096.255     0.825000        27493         5.71
   32899.071     0.850000        28332         6.67
   34209.791     0.875000        29142         8.00
   36700.159     0.887500        29570         8.89
   39223.295     0.900000        29976        10.00
   41779.199     0.912500        30391        11.43
   44072.959     0.925000        30810        13.33
   45678.591     0.937500        31224        16.00
   46301.183     0.943750        31436        17.78
   46891.007     0.950000        31640        20.00
   47415.295     0.956250        31863        22.86
   48037.887     0.962500        32069        26.67
   48693.247     0.968750        32280        32.00
   48922.623     0.971875        32383        35.56
   49217.535     0.975000        32495        40.00
   49512.447     0.978125        32590        45.71
   49807.359     0.981250        32687        53.33
   50135.039     0.984375        32792        64.00
   50298.879     0.985938        32849        71.11
   50429.951     0.987500        32890        80.00
   50593.791     0.989062        32943        91.43
   50790.399     0.990625        33008       106.67
   50921.471     0.992188        33061       128.00
   50987.007     0.992969        33078       142.22
   51019.775     0.993750        33108       160.00
   51085.311     0.994531        33124       182.86
   51118.079     0.995313        33155       213.33
   51216.383     0.996094        33186       256.00
   51281.919     0.996484        33191       284.44
   51314.687     0.996875        33215       320.00
   51314.687     0.997266        33215       365.71
   51412.991     0.997656        33253       426.67
   51412.991     0.998047        33253       512.00
   51412.991     0.998242        33253       568.89
   51412.991     0.998437        33253       640.00
   51511.295     0.998633        33275       731.43
   51511.295     0.998828        33275       853.33
   51511.295     0.999023        33275      1024.00
   51576.831     0.999121        33276      1137.78
   51609.599     0.999219        33289      1280.00
   51609.599     0.999316        33289      1462.86
   51609.599     0.999414        33289      1706.67
   51609.599     0.999512        33289      2048.00
   51675.135     0.999561        33291      2275.56
   51707.903     0.999609        33305      2560.00
   51707.903     1.000000        33305          inf
#[Mean    =    24416.170, StdDeviation   =     9914.445]
#[Max     =    51675.136, Total count    =        33305]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  40027 requests in 1.00m, 16.50MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:    666.95
Transfer/sec:    281.60KB